wrk/output/1_get_empty_wrk.txt
Running 30s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 3.821ms, rate sampling interval: 21ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.04ms   12.09ms  61.86ms   88.19%
    Req/Sec    10.26k     1.28k   14.40k    76.55%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.62ms
 75.000%    6.23ms
 90.000%   22.80ms
 99.000%   54.88ms
 99.900%   60.03ms
 99.990%   61.53ms
 99.999%   61.85ms
100.000%   61.89ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.066     0.000000            1         1.00
       0.422     0.100000        20057         1.11
       0.685     0.200000        39994         1.25
       0.920     0.300000        60018         1.43
       1.144     0.400000        80069         1.67
       1.625     0.500000        99994         2.00
       2.103     0.550000       109988         2.22
       2.813     0.600000       119981         2.50
       3.665     0.650000       129986         2.86
       4.803     0.700000       139991         3.33
       6.227     0.750000       149978         4.00
       7.403     0.775000       154971         4.44
       8.855     0.800000       159992         5.00
      11.191     0.825000       164970         5.71
      14.743     0.850000       169976         6.67
      18.239     0.875000       174984         8.00
      20.415     0.887500       177462         8.89
      22.799     0.900000       179966        10.00
      25.039     0.912500       182473        11.43
      29.119     0.925000       184964        13.33
      34.143     0.937500       187477        16.00
      35.935     0.943750       188710        17.78
      38.655     0.950000       189971        20.00
      40.863     0.956250       191220        22.86
      43.647     0.962500       192461        26.67
      45.855     0.968750       193726        32.00
      46.847     0.971875       194342        35.56
      48.063     0.975000       194964        40.00
      49.119     0.978125       195583        45.71
      50.879     0.981250       196210        53.33
      52.127     0.984375       196833        64.00
      53.151     0.985938       197154        71.11
      53.631     0.987500       197467        80.00
      54.271     0.989062       197780        91.43
      55.135     0.990625       198084       106.67
      56.127     0.992188       198400       128.00
      56.639     0.992969       198568       142.22
      56.863     0.993750       198726       160.00
      57.183     0.994531       198865       182.86
      57.695     0.995313       199029       213.33
      58.047     0.996094       199176       256.00
      58.303     0.996484       199262       284.44
      58.463     0.996875       199344       320.00
      58.719     0.997266       199412       365.71
      59.103     0.997656       199494       426.67
      59.391     0.998047       199574       512.00
      59.487     0.998242       199609       568.89
      59.615     0.998437       199659       640.00
      59.711     0.998633       199690       731.43
      59.903     0.998828       199731       853.33
      60.031     0.999023       199766      1024.00
      60.095     0.999121       199799      1137.78
      60.127     0.999219       199820      1280.00
      60.159     0.999316       199836      1462.86
      60.191     0.999414       199846      1706.67
      60.287     0.999512       199861      2048.00
      60.383     0.999561       199870      2275.56
      60.479     0.999609       199879      2560.00
      60.639     0.999658       199889      2925.71
      60.863     0.999707       199899      3413.33
      61.023     0.999756       199909      4096.00
      61.087     0.999780       199915      4551.11
      61.119     0.999805       199920      5120.00
      61.183     0.999829       199923      5851.43
      61.311     0.999854       199928      6826.67
      61.439     0.999878       199933      8192.00
      61.503     0.999890       199936      9102.22
      61.567     0.999902       199938     10240.00
      61.599     0.999915       199940     11702.86
      61.663     0.999927       199943     13653.33
      61.695     0.999939       199945     16384.00
      61.727     0.999945       199947     18204.44
      61.759     0.999951       199949     20480.00
      61.759     0.999957       199949     23405.71
      61.791     0.999963       199951     27306.67
      61.791     0.999969       199951     32768.00
      61.823     0.999973       199952     36408.89
      61.855     0.999976       199955     40960.00
      61.855     0.999979       199955     46811.43
      61.855     0.999982       199955     54613.33
      61.855     0.999985       199955     65536.00
      61.855     0.999986       199955     72817.78
      61.855     0.999988       199955     81920.00
      61.855     0.999989       199955     93622.86
      61.887     0.999991       199957    109226.67
      61.887     1.000000       199957          inf
#[Mean    =        7.036, StdDeviation   =       12.088]
#[Max     =       61.856, Total count    =       199957]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  299989 requests in 30.00s, 19.74MB read
  Non-2xx or 3xx responses: 299989
Requests/sec:   9999.78
Transfer/sec:    673.81KB