wrk/output/1_get_empty_wrk.txt
Running 30s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 4860.804ms, rate sampling interval: 18579ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.75s     5.07s   29.80s    76.96%
    Req/Sec    49.00      0.00    49.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.98s 
 75.000%   17.30s 
 90.000%   24.92s 
 99.000%   29.33s 
 99.900%   29.77s 
 99.990%   29.82s 
 99.999%   29.82s 
100.000%   29.82s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9977.855     0.000000            1         1.00
   11214.847     0.100000           96         1.11
   12115.967     0.200000          191         1.25
   12886.015     0.300000          288         1.43
   13500.415     0.400000          383         1.67
   13975.551     0.500000          478         2.00
   14155.775     0.550000          527         2.22
   14295.039     0.600000          576         2.50
   14385.151     0.650000          622         2.86
   14712.831     0.700000          669         3.33
   17350.655     0.750000          717         4.00
   18661.375     0.775000          741         4.44
   19890.175     0.800000          764         5.00
   21135.359     0.825000          788         5.71
   22413.311     0.850000          812         6.67
   23674.879     0.875000          836         8.00
   24297.471     0.887500          848         8.89
   24920.063     0.900000          860        10.00
   25542.655     0.912500          872        11.43
   26165.247     0.925000          884        13.33
   26836.991     0.937500          896        16.00
   27148.287     0.943750          902        17.78
   27459.583     0.950000          908        20.00
   27770.879     0.956250          914        22.86
   28065.791     0.962500          920        26.67
   28360.703     0.968750          926        32.00
   28524.543     0.971875          929        35.56
   28671.999     0.975000          932        40.00
   28819.455     0.978125          935        45.71
   28966.911     0.981250          938        53.33
   29114.367     0.984375          941        64.00
   29163.519     0.985938          942        71.11
   29261.823     0.987500          944        80.00
   29327.359     0.989062          945        91.43
   29409.279     0.990625          947       106.67
   29458.431     0.992188          948       128.00
   29507.583     0.992969          949       142.22
   29573.119     0.993750          950       160.00
   29573.119     0.994531          950       182.86
   29622.271     0.995313          951       213.33
   29671.423     0.996094          952       256.00
   29671.423     0.996484          952       284.44
   29720.575     0.996875          953       320.00
   29720.575     0.997266          953       365.71
   29720.575     0.997656          953       426.67
   29769.727     0.998047          954       512.00
   29769.727     0.998242          954       568.89
   29769.727     0.998437          954       640.00
   29769.727     0.998633          954       731.43
   29769.727     0.998828          954       853.33
   29818.879     0.999023          955      1024.00
   29818.879     1.000000          955          inf
#[Mean    =    15746.748, StdDeviation   =     5074.075]
#[Max     =    29802.496, Total count    =          955]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1290 requests in 30.01s, 86.92KB read
  Non-2xx or 3xx responses: 1290
Requests/sec:     42.99
Transfer/sec:      2.90KB