wrk/output/1_get_empty_wrk.txt
Running 30s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 9.990ms, rate sampling interval: 60ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.16ms   15.83ms  75.71ms   88.66%
    Req/Sec    10.09k   768.48    12.44k    76.28%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.10ms
 75.000%    6.57ms
 90.000%   26.96ms
 99.000%   66.11ms
 99.900%   73.73ms
 99.990%   75.52ms
 99.999%   75.78ms
100.000%   75.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.065     0.000000            3         1.00
       0.314     0.100000        20070         1.11
       0.522     0.200000        40010         1.25
       0.724     0.300000        60050         1.43
       0.913     0.400000        79988         1.67
       1.100     0.500000       100036         2.00
       1.237     0.550000       109993         2.22
       1.708     0.600000       119964         2.50
       2.767     0.650000       129953         2.86
       4.495     0.700000       139961         3.33
       6.575     0.750000       149959         4.00
       7.831     0.775000       154954         4.44
       9.399     0.800000       159954         5.00
      11.583     0.825000       164954         5.71
      15.319     0.850000       169939         6.67
      20.719     0.875000       174963         8.00
      24.303     0.887500       177443         8.89
      26.959     0.900000       179945        10.00
      30.367     0.912500       182435        11.43
      36.255     0.925000       184933        13.33
      49.087     0.937500       187447        16.00
      53.247     0.943750       188686        17.78
      56.255     0.950000       189938        20.00
      58.367     0.956250       191196        22.86
      59.423     0.962500       192446        26.67
      60.543     0.968750       193701        32.00
      61.375     0.971875       194314        35.56
      62.079     0.975000       194945        40.00
      62.687     0.978125       195555        45.71
      63.359     0.981250       196187        53.33
      64.191     0.984375       196814        64.00
      64.671     0.985938       197120        71.11
      65.407     0.987500       197456        80.00
      65.855     0.989062       197768        91.43
      66.303     0.990625       198094       106.67
      66.943     0.992188       198378       128.00
      67.583     0.992969       198530       142.22
      68.479     0.993750       198683       160.00
      69.823     0.994531       198838       182.86
      70.975     0.995313       198997       213.33
      71.551     0.996094       199165       256.00
      71.807     0.996484       199231       284.44
      72.063     0.996875       199320       320.00
      72.383     0.997266       199387       365.71
      72.767     0.997656       199467       426.67
      73.023     0.998047       199561       512.00
      73.087     0.998242       199591       568.89
      73.215     0.998437       199624       640.00
      73.343     0.998633       199656       731.43
      73.535     0.998828       199699       853.33
      73.727     0.999023       199742      1024.00
      73.791     0.999121       199759      1137.78
      73.919     0.999219       199772      1280.00
      74.111     0.999316       199791      1462.86
      74.239     0.999414       199818      1706.67
      74.431     0.999512       199832      2048.00
      74.687     0.999561       199843      2275.56
      74.815     0.999609       199850      2560.00
      75.071     0.999658       199862      2925.71
      75.199     0.999707       199871      3413.33
      75.327     0.999756       199882      4096.00
      75.391     0.999780       199890      4551.11
      75.391     0.999805       199890      5120.00
      75.455     0.999829       199898      5851.43
      75.455     0.999854       199898      6826.67
      75.519     0.999878       199907      8192.00
      75.519     0.999890       199907      9102.22
      75.583     0.999902       199912     10240.00
      75.583     0.999915       199912     11702.86
      75.647     0.999927       199916     13653.33
      75.647     0.999939       199916     16384.00
      75.711     0.999945       199920     18204.44
      75.711     0.999951       199920     20480.00
      75.711     0.999957       199920     23405.71
      75.711     0.999963       199920     27306.67
      75.775     0.999969       199927     32768.00
      75.775     1.000000       199927          inf
#[Mean    =        8.157, StdDeviation   =       15.828]
#[Max     =       75.712, Total count    =       199927]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  299946 requests in 30.00s, 19.74MB read
  Non-2xx or 3xx responses: 299946
Requests/sec:   9998.20
Transfer/sec:    673.71KB